// JavaScript Document
//定义一个二维数组two_dl,用于存放二级分类名称 
var two_dl=new Array(); 
two_dl[0]=new Array(); 
two_dl[1]=new Array(); 
two_dl[2]=new Array(); 
two_dl[3]=new Array(); 
two_dl[4] = new Array();
two_dl[5] = new Array();
two_dl[6] = new Array();
two_dl[7] = new Array();
two_dl[8] = new Array();
two_dl[9] = new Array();
two_dl[10] = new Array();
two_dl[11] = new Array();
two_dl[12] = new Array();
two_dl[13] = new Array();
two_dl[14] = new Array();
two_dl[15] = new Array();
two_dl[16] = new Array();
two_dl[17] = new Array();
two_dl[18] = new Array();
two_dl[19] = new Array();
two_dl[20] = new Array();
two_dl[21] = new Array();
//赋值，每个一级分类的二级分类存放于数组的一行。 
two_dl[0][0] = "--请选择--";
two_dl[1][0] = "--请选择--";
two_dl[1][1] = "段庄";
two_dl[1][2] = "黄骅南";
two_dl[1][3] = "李天木";
two_dl[1][4] = "沧州西";
two_dl[1][5] = "杜生";
two_dl[1][6] = "黎民居";
two_dl[1][7] = "行别营";
two_dl[1][8] = "河间";
two_dl[1][9] = "太师庄";
two_dl[1][10] = "肃宁北";
two_dl[1][11] = "蠡县";
two_dl[1][12] = "博野";
two_dl[1][13] = "安国";
two_dl[1][14] = "定州东";
two_dl[1][15] = "定州西";
two_dl[1][16] = "新曲";
two_dl[1][17] = "行唐";
two_dl[1][18] = "灵寿";
two_dl[1][19] = "三汲";
two_dl[1][20] = "西柏坡";
//---------------------
two_dl[2][0] = "--请选择--";
two_dl[2][1] = "黄骅南";
two_dl[2][2] = "李天木";
two_dl[2][3] = "沧州西";
two_dl[2][4] = "杜生";
two_dl[2][5] = "黎民居";
two_dl[2][6] = "行别营";
two_dl[2][7] = "河间";
two_dl[2][8] = "太师庄";
two_dl[2][9] = "肃宁北";
two_dl[2][10] = "蠡县";
two_dl[2][11] = "博野";
two_dl[2][12] = "安国";
two_dl[2][13] = "定州东";
two_dl[2][14] = "定州西";
two_dl[2][15] = "新曲";
two_dl[2][16] = "行唐";
two_dl[2][17] = "灵寿";
two_dl[2][18] = "三汲";
two_dl[2][19] = "西柏坡";
//---------------------
two_dl[3][0] = "--请选择--";
two_dl[3][1] = "李天木";
two_dl[3][2] = "沧州西";
two_dl[3][3] = "杜生";
two_dl[3][4] = "黎民居";
two_dl[3][5] = "行别营";
two_dl[3][6] = "河间";
two_dl[3][7] = "太师庄";
two_dl[3][8] = "肃宁北";
two_dl[3][9] = "蠡县";
two_dl[3][10] = "博野";
two_dl[3][11] = "安国";
two_dl[3][12] = "定州东";
two_dl[3][13] = "定州西";
two_dl[3][14] = "新曲";
two_dl[3][15] = "行唐";
two_dl[3][16] = "灵寿";
two_dl[3][17] = "三汲";
two_dl[3][18] = "西柏坡";
//---------------------
two_dl[4][0] = "--请选择--";
two_dl[4][1] = "沧州西";
two_dl[4][2] = "杜生";
two_dl[4][3] = "黎民居";
two_dl[4][4] = "行别营";
two_dl[4][5] = "河间";
two_dl[4][6] = "太师庄";
two_dl[4][7] = "肃宁北";
two_dl[4][8] = "蠡县";
two_dl[4][9] = "博野";
two_dl[4][10] = "安国";
two_dl[4][11] = "定州东";
two_dl[4][12] = "定州西";
two_dl[4][13] = "新曲";
two_dl[4][14] = "行唐";
two_dl[4][15] = "灵寿";
two_dl[4][16] = "三汲";
two_dl[4][17] = "西柏坡";
//---------------------
two_dl[5][0] = "--请选择--";
two_dl[5][1] = "杜生";
two_dl[5][2] = "黎民居";
two_dl[5][3] = "行别营";
two_dl[5][4] = "河间";
two_dl[5][5] = "太师庄";
two_dl[5][6] = "肃宁北";
two_dl[5][7] = "蠡县";
two_dl[5][8] = "博野";
two_dl[5][9] = "安国";
two_dl[5][10] = "定州东";
two_dl[5][11] = "定州西";
two_dl[5][12] = "新曲";
two_dl[5][13] = "行唐";
two_dl[5][14] = "灵寿";
two_dl[5][15] = "三汲";
two_dl[5][16] = "西柏坡";
//---------------------
two_dl[6][0] = "--请选择--";
two_dl[6][1] = "黎民居";
two_dl[6][2] = "行别营";
two_dl[6][3] = "河间";
two_dl[6][4] = "太师庄";
two_dl[6][5] = "肃宁北";
two_dl[6][6] = "蠡县";
two_dl[6][7] = "博野";
two_dl[6][8] = "安国";
two_dl[6][9] = "定州东";
two_dl[6][10] = "定州西";
two_dl[6][11] = "新曲";
two_dl[6][12] = "行唐";
two_dl[6][13] = "灵寿";
two_dl[6][14] = "三汲";
two_dl[6][15] = "西柏坡";
//---------------------
two_dl[7][0] = "--请选择--";
two_dl[7][1] = "行别营";
two_dl[7][2] = "河间";
two_dl[7][3] = "太师庄";
two_dl[7][4] = "肃宁北";
two_dl[7][5] = "蠡县";
two_dl[7][6] = "博野";
two_dl[7][7] = "安国";
two_dl[7][8] = "定州东";
two_dl[7][9] = "定州西";
two_dl[7][10] = "新曲";
two_dl[7][11] = "行唐";
two_dl[7][12] = "灵寿";
two_dl[7][13] = "三汲";
two_dl[7][14] = "西柏坡";
//---------------------
two_dl[8][0] = "--请选择--";
two_dl[8][1] = "河间";
two_dl[8][2] = "太师庄";
two_dl[8][3] = "肃宁北";
two_dl[8][4] = "蠡县";
two_dl[8][5] = "博野";
two_dl[8][6] = "安国";
two_dl[8][7] = "定州东";
two_dl[8][8] = "定州西";
two_dl[8][9] = "新曲";
two_dl[8][10] = "行唐";
two_dl[8][11] = "灵寿";
two_dl[8][12] = "三汲";
two_dl[8][13] = "西柏坡";
//---------------------
two_dl[9][0] = "--请选择--";
two_dl[9][1] = "太师庄";
two_dl[9][2] = "肃宁北";
two_dl[9][3] = "蠡县";
two_dl[9][4] = "博野";
two_dl[9][5] = "安国";
two_dl[9][6] = "定州东";
two_dl[9][7] = "定州西";
two_dl[9][8] = "新曲";
two_dl[9][9] = "行唐";
two_dl[9][10] = "灵寿";
two_dl[9][11] = "三汲";
two_dl[9][12] = "西柏坡";
//---------------------
two_dl[10][0] = "--请选择--";
two_dl[10][1] = "肃宁北";
two_dl[10][2] = "蠡县";
two_dl[10][3] = "博野";
two_dl[10][4] = "安国";
two_dl[10][5] = "定州东";
two_dl[10][6] = "定州西";
two_dl[10][7] = "新曲";
two_dl[10][8] = "行唐";
two_dl[10][9] = "灵寿";
two_dl[10][10] = "三汲";
two_dl[10][11] = "西柏坡";
//---------------------
two_dl[11][0] = "--请选择--";
two_dl[11][1] = "蠡县";
two_dl[11][2] = "博野";
two_dl[11][3] = "安国";
two_dl[11][4] = "定州东";
two_dl[11][5] = "定州西";
two_dl[11][6] = "新曲";
two_dl[11][7] = "行唐";
two_dl[11][8] = "灵寿";
two_dl[11][9] = "三汲";
two_dl[11][10] = "西柏坡";
//---------------------
two_dl[12][0] = "--请选择--";
two_dl[12][1] = "博野";
two_dl[12][2] = "安国";
two_dl[12][3] = "定州东";
two_dl[12][4] = "定州西";
two_dl[12][5] = "新曲";
two_dl[12][6] = "行唐";
two_dl[12][7] = "灵寿";
two_dl[12][8] = "三汲";
two_dl[12][9] = "西柏坡";
//---------------------
two_dl[13][0] = "--请选择--";
two_dl[13][1] = "安国";
two_dl[13][2] = "定州东";
two_dl[13][3] = "定州西";
two_dl[13][4] = "新曲";
two_dl[13][5] = "行唐";
two_dl[13][6] = "灵寿";
two_dl[13][7] = "三汲";
two_dl[13][8] = "西柏坡";
//---------------------
two_dl[14][0] = "--请选择--";
two_dl[14][1] = "定州东";
two_dl[14][2] = "定州西";
two_dl[14][3] = "新曲";
two_dl[14][4] = "行唐";
two_dl[14][5] = "灵寿";
two_dl[14][6] = "三汲";
two_dl[14][7] = "西柏坡";
//---------------------
two_dl[15][0] = "--请选择--";
two_dl[15][1] = "定州西";
two_dl[15][2] = "新曲";
two_dl[15][3] = "行唐";
two_dl[15][4] = "灵寿";
two_dl[15][5] = "三汲";
two_dl[15][6] = "西柏坡";
//---------------------
two_dl[16][0] = "--请选择--";
two_dl[16][1] = "新曲";
two_dl[16][2] = "行唐";
two_dl[16][3] = "灵寿";
two_dl[16][4] = "三汲";
two_dl[16][5] = "西柏坡";
//---------------------
two_dl[17][0] = "--请选择--";
two_dl[17][1] = "行唐";
two_dl[17][2] = "灵寿";
two_dl[17][3] = "三汲";
two_dl[17][4] = "西柏坡";
//---------------------
two_dl[18][0] = "--请选择--";
two_dl[18][1] = "灵寿";
two_dl[18][2] = "三汲";
two_dl[18][3] = "西柏坡";
//---------------------
two_dl[19][0] = "--请选择--";
two_dl[19][1] = "三汲";
two_dl[19][2] = "西柏坡";
//---------------------
two_dl[20][0] = "--请选择--";
two_dl[20][1] = "西柏坡";
//---------------------
two_dl[21][0] = "--请选择--";

function ChangeDL() {
    var i, Index;
    Index = document.getElementById("oneclass_dl").selectedIndex;
    iCount = 0;
    while (two_dl[Index][iCount] != null) iCount++;//计算选定一级分类的二级分类个数 
    document.getElementById("twoclass_dl").length = iCount;//改变下拉菜单的选项数
    for (i = 0; i <= iCount - 1; i++)//改变下拉菜单的内容 
        document.getElementById("twoclass_dl")[i] = new Option(two_dl[Index][i]);
    document.getElementById("twoclass_dl").focus();
}